import React from 'react'
import './Thirukural.css'
const Thirukural = () => {
  return (
    <div className='kurall'> 
      <p className='one'> கடவுள் வாழ்த்து</p>
      <div className='kural'>
      <strong><p>குறள் 1:</p></strong>
      <p>அகர முதல எழுத்தெல்லாம் ஆதி <br />பகவன் முதற்றே உலகு</p>
      <strong><p>மு.வ உரை:</p></strong>
      <p>எழுத்துக்கள் எல்லாம் அகரத்தை அடிப்படையாக கொண்டிருக்கின்றன. அதுபோல உலகம் கடவுளை அடிப்படையாக கொண்டிருக்கிறது.</p>
      <strong><p>சாலமன் பாப்பையா உரை:</p></strong>
      <p>எழுத்துக்கள் எல்லாம் அகரத்தில் தொடங்குகின்றன; (அது போல) உலகம் கடவுளில் தொடங்குகிறது.</p>
      <strong><p>கலைஞர் உரை:</p></strong>
      <p>அகரம் எழுத்துக்களுக்கு முதன்மை; ஆதிபகவன், உலகில் வாழும் உயிர்களுக்கு முதன்மை</p>
      </div>
      <div className='kural'>
      <strong><p>குறள் 2:</p></strong>
      <p>கற்றதனால் ஆய பயனென்கொல் வாலறிவன் <br />நற்றாள் தொழாஅர் எனின்</p>
      <strong><p>மு.வ உரை:</p></strong>      
      <p>தூய அறிவு வடிவாக விளங்கும் இறைவனுடைய நல்ல திருவடிகளை தொழாமல் இருப்பாரானால், அவர் கற்ற கல்வியினால் ஆகிய பயன் என்ன?</p>      
      <strong><p>சாலமன் பாப்பையா உரை:</p></strong>
      <p>தூய அறிவு வடிவானவனின் திருவடிகளை வணங்காதவர், படித்ததனால் பெற்ற பயன்தான் என்ன?</p>
      <strong><p>கலைஞர் உரை:</p></strong>
      <p>தன்னைவிட அறிவில் மூத்த பெருந்தகையாளரின் முன்னே வணங்கி நிற்கும் பண்பு இல்லாவிடில் என்னதான் ஒருவர் கற்றிருந்தாலும் அதனால் என்ன பயன்? ஒன்றுமில்லை</p>
      </div>
      <div className='kural'>
      <strong><p>குறள் 3:</p></strong>
      <p>மலர்மிசை ஏகினான் மாணடி சேர்ந்தார்<br />
      நிலமிசை நீடுவாழ் வார்</p>
      <strong><p>மு.வ உரை:</p></strong>      
      <p>அன்பரின் அகமாகிய மலரில் வீற்றிருக்கும் கடவுளின் சிறந்த திருவடிகளை பொருந்தி நினைக்கின்றவர், இன்ப உலகில் நிலைத்து வாழ்வார்</p>      
      <strong><p>சாலமன் பாப்பையா உரை:</p></strong>
      <p>மனமாகிய மலர்மீது சென்று இருப்பவனாகிய கடவுளின் சிறந்த திருவடிகளை எப்போதும் நினைப்பவர் இப்பூமியில் நெடுங்காலம் வாழ்வர்</p>
      <strong><p>கலைஞர் உரை:</p></strong>
      <p>மலர் போன்ற மனத்தில் நிறைந்தவனைப் பின்பற்றுவோரின் புகழ்வாழ்வு, உலகில் நெடுங்காலம் நிலைத்து நிற்கும்</p>      
    </div>
      <div className='kural'>
      <strong><p>குறள் 4:</p></strong>
      <p>வேண்டுதல்வேண் டாமை இலானடி சேர்ந்தார்க்கு<br />
      யாண்டும் இடும்பை இல</p>      
    <strong><p>மு.வ உரை:</p></strong>      
    <p>விருப்பு வெறுப்பு இல்லாத கடவுளின் திருவடிகளை பொருந்தி நினைக்கின்றவர்க்கு எப்போதும் எவ்விடத்திலும் துன்பம் இல்லை</p>      
    <strong><p>சாலமன் பாப்பையா உரை:</p></strong>
      <p>எதிலும் விருப்பு வெறுப்பு இல்லாத கடவுளின் திருவடிகளை மனத்தால் எப்போதும் நினைப்பவருக்கு உலகத் துன்பம் ஒருபோதும் இல்லை</p>
      <strong><p>கலைஞர் உரை:</p></strong>
      <p>விருப்பு வெறுப்பற்றுத் தன்னலமின்றித் திகழ்கின்றவரைப் பின்பற்றி நடப்பவர்களுக்கு எப்போதுமே துன்பம் ஏற்படுவதில்லை</p>      
    </div>
      <div className='kural'>
      <strong><p>குறள் 5:</p></strong>
      <p>இருள்சேர் இருவினையும் சேரா இறைவன் <br />
      பொருள்சேர் புகழ்புரிந்தார் மாட்டு</p>
      <strong><p>மு.வ உரை:</p></strong>      
      <p>கடவுளின் உண்மைப் புகழை விரும்பி அன்பு செலுத்துகின்றவரிடம் அறியாமையால் விளையும் இருவகை வினையும் சேர்வதில்லை</p>      
      <strong><p>சாலமன் பாப்பையா உரை:</p></strong>
      <p>கடவுளின் மெய்மைப் புகழையே விரும்புபவரிடம் அறியாமை இருளால் வரும் நல்வினை, தீவினை என்னும் இரண்டும் சேருவதில்லை</p>
      <strong><p>கலைஞர் உரை:</p></strong>
      <p>இறைவன் என்பதற்குரிய பொருளைப் புரிந்து கொண்டு புகழ் பெற விரும்புகிறவர்கள், நன்மை தீமைகளை ஒரே அளவில் எதிர் கொள்வார்கள்      </p>
      </div>
      <div className='kural'>
      <strong><p>குறள் 6:</p></strong>
      <p>கற்றதனால் ஆய பயனென்கொல் வாலறிவன் <br />நற்றாள் தொழாஅர் எனின்</p>
      <strong><p>மு.வ உரை:</p></strong>      
      <p>தூய அறிவு வடிவாக விளங்கும் இறைவனுடைய நல்ல திருவடிகளை தொழாமல் இருப்பாரானால், அவர் கற்ற கல்வியினால் ஆகிய பயன் என்ன?</p>      
      <strong><p>சாலமன் பாப்பையா உரை:</p></strong>
      <p>தூய அறிவு வடிவானவனின் திருவடிகளை வணங்காதவர், படித்ததனால் பெற்ற பயன்தான் என்ன?</p>
      <strong><p>கலைஞர் உரை:</p></strong>
      <p>தன்னைவிட அறிவில் மூத்த பெருந்தகையாளரின் முன்னே வணங்கி நிற்கும் பண்பு இல்லாவிடில் என்னதான் ஒருவர் கற்றிருந்தாலும் அதனால் என்ன பயன்? ஒன்றுமில்லை</p>
      </div>
      <div className='kural'>
      <strong><p>குறள் 7:</p></strong>
      <p>தனக்குவமை இல்லாதான் தாள்சேர்ந்தார்க் கல்லால் <br />
      மனக்கவலை மாற்றல் அரிது</p>
      <strong><p>மு.வ உரை:</p></strong>      
      <p>தனக்கு ஒப்புமை இல்லாத தலைவனுடைய திருவடிகளைப் பொருந்தி நினைக்கின்றவர் அல்லாமல், மற்றவர்க்கு மனக்கவலையை மாற்ற முடியாது</p>      
      <strong><p>சாலமன் பாப்பையா உரை:</p></strong>
      <p>தனக்கு இணையில்லாத கடவுளின் திருவடிகளைச் சேர்ந்தவர்க்கே அன்றி, மற்றவர்களுக்கு மனக்கவலையைப் போக்குவது கடினம்</p>
      <strong><p>கலைஞர் உரை:</p></strong>
      <p>ஒப்பாரும் மிக்காருமில்லாதவனுடைய அடியொற்றி நடப்பவர்களைத் தவிர, மற்றவர்களின் மனக்கவலை தீர வழியேதுமில்லை</p>
      </div>
      <div className='kural'>
      <strong><p>குறள் 8:</p></strong>
      <p>கற்றதனால் ஆய பயனென்கொல் வாலறிவன் <br />நற்றாள் தொழாஅர் எனின்</p>
      <strong><p>மு.வ உரை:</p></strong>      
      <p>தூய அறிவு வடிவாக விளங்கும் இறைவனுடைய நல்ல திருவடிகளை தொழாமல் இருப்பாரானால், அவர் கற்ற கல்வியினால் ஆகிய பயன் என்ன?</p>      
      <strong><p>சாலமன் பாப்பையா உரை:</p></strong>
      <p>தூய அறிவு வடிவானவனின் திருவடிகளை வணங்காதவர், படித்ததனால் பெற்ற பயன்தான் என்ன?</p>
      <strong><p>கலைஞர் உரை:</p></strong>
      <p>தன்னைவிட அறிவில் மூத்த பெருந்தகையாளரின் முன்னே வணங்கி நிற்கும் பண்பு இல்லாவிடில் என்னதான் ஒருவர் கற்றிருந்தாலும் அதனால் என்ன பயன்? ஒன்றுமில்லை</p>
      </div>
      <div className='kural'>
      <strong><p>குறள் 9:</p></strong>
      <p>கோளில் பொறியின் குணமிலவே எண்குணத்தான்<br />
      தாளை வணங்காத் தலை</p>
      <strong><p>மு.வ உரை:</p></strong>      
      <p>கேட்காதசெவி, பார்க்காத கண் போன்ற எண் குணங்களை உடைய கடவுளின் திருவடிகளை வணங்காதவரின் தலைகள் பயனற்றவைகளாம்</p>      
      <strong><p>சாலமன் பாப்பையா உரை:</p></strong>
      <p>எண்ணும் நல்ல குணங்களுக்கு எல்லாம் இருப்பிடமான கடவுளின் திருவடிகளை வணங்காத தலைகள், புலன்கள் இல்லாத பொறிகள்போல, இருந்தும் பயன் இல்லாதவையே
      </p>
      <strong><p>கலைஞர் உரை:</p></strong>
      <p>உடல், கண், காது, மூக்கு, வாய் எனும் ஐம்பொறிகள் இருந்தும், அவைகள் இயங்காவிட்டால் என்ன நிலையோ அதே நிலைதான் ஈடற்ற ஆற்றலும் பண்பும் கொண்டவனை வணங்கி நடக்காதவனின் நிலையும் ஆகும்
      </p>
      </div>
      <div className='kural'>
      <strong><p>குறள் 10:</p></strong>
      <p>பிறவிப் பெருங்கடல் நீந்துவர் நீந்தார்<br />
      இறைவன் அடிசேரா தார்</p>
      <strong><p>மு.வ உரை:</p></strong>      
      <p>இறைவனுடைய திருவடிகளை பொருந்தி நினைக்கின்றவர் பிறவியாகிய பெரிய கடலைக் கடக்க முடியும். மற்றவர் கடக்க முடியாது</p>      
      <strong><p>சாலமன் பாப்பையா உரை:</p></strong>
      <p>கடவுளின் திருவடிகளைச் சேர்ந்தவர் பிறவியாகிய பெருங்கடலை நீந்திக் கடப்பர்; மற்றவர் நீந்தவும் மாட்டார்</p>
      <strong><p>கலைஞர் உரை:</p></strong>
      <p>வாழ்க்கை எனும் பெருங்கடலை நீந்திக் கடக்க முனைவோர், தலையானவனாக இருப்பவனின் அடி தொடர்ந்து செல்லாவிடில் நீந்த முடியாமல் தவிக்க நேரிடும்</p>
      </div>
    </div>
  )
}

export default Thirukural
