import React from 'react'
import './TamilTopics.css'
import { Link } from 'react-router-dom'
const TamilTopics = () => {
  return (
    <div className='topics01'> 
    <div className=' topic d-flex'>
      <div className='topics02'>
      <h2>அகநானூறு</h2>
      <p className='tamilpara'>அகநானூறு எட்டுத்தொகை எனப்படும் சங்ககாலத்தமிழ் நூல் தொகுப்பில் உள்ள ஒரு நூலாகும். இந்நூல் அகத்திணை சார்ந்த நானூறு பாடல்களின் தொகுப்பாக விளங்குவதால் அகநானூறு என வழங்கப்படுகிறது. இதற்கு நெடுந்தொகை என்ற மற்றொரு பெயரும் உண்டு. இதில் அடங்கியுள்ள பாடல்கள் பல்வேறு காலங்களில் வாழ்ந்த பல்வேறு புலவர்கள் பாடிய பாடல்களின் தொகுப்பாகும்.இந்நூல் அகத்திணை சார்ந்த நானூறு பாடல்களின் தொகுப்பாக விளங்குவதால் அகநானூறு என வழங்கப்படுகிறது. இதற்கு நெடுந்தொகை என்ற மற்றொரு பெயரும் உண்டு.இதற்கு நெடுந்தொகை என்றும் பெயர் உண்டு. இதனைத் தொகுப்பித்தவன் பாண்டியன் உக்கிரப்பெருவழுதி; தொகுத்தவன் மதுரை உப்பூரி குடி கிழான்மகன் உருத்திரசன்மன். </p>
      </div>
      <div className='topics02'>
      <h2>புறநானூறு</h2>
      <p className='tamilpara'>புறநானூறு என்னும் தொகைநூல் நானூறு பாடல்களைக் கொண்ட புறத்திணை சார்ந்த ஒரு சங்கத் தமிழ் நூலாகும். புறம், புறப்பாட்டு, நந்தா விளக்கம் என்றும் வழங்கப்படும். இது சங்க காலத் தமிழ் நூல் தொகுப்பான எட்டுத்தொகை நூல்களில் புறநூல்களுள் ஒன்று. இந்நூலைத் தொகுத்தவர் பெயரும், தொகுப்பித்தவர் பெயரும் தெரியவில்லை. இந்நூலின் பாக்கள் 4 அடி முதல் 40 அடி வரையிலான ஆசிரியப்பாவால் அமைந்து உள்ளன.புறநானூற்றின் பாடல்கள் சங்ககாலத்தில் ஆண்ட அரசர்களைப் பற்றியும் மக்களின் சமூக வாழ்க்கை பற்றியும் எடுத்துரைக்கின்றன. இதனை ஜி. யு. போப் ஆங்கிலத்தில் மொழிபெயர்த்துள்ளார்.</p>
      </div>
      </div>
      <div className='topic2'>
      <div className='topics03'>
      <h2>திருக்குறள்</h2>
      <p className='tamilpara'>திருக்குறளில் அதிகள் பயன்பாடாத எழுத்து ஔ. திருக்குறளில் உள்ள மொத்த எழுத்துகள் 42,194. தமிழ் எழுத்துக்கள் 247-இல் 37 எழுத்துகள் மட்டும் இடம்பெறவில்லை. திருக்குறளில் பயன்படுத்தப்படாத ஒரே உயிரெழுத்து ஔ.குறளானது, ஈரடிகளில் உலகத் தத்துவங்களைச் சொன்னதால், இஃது 'ஈரடி நூல்' என்றும், அறம், பொருள், இன்பம் அல்லது காமம் என்னும் முப்பெரும் பிரிவுகளைக் கொண்டதால், 'முப்பால்' என்றும் அழைக்கப்படுகிறது.திருக்குறளின் பெருமையை விளக்கும் நூல் திருவள்ளுவமாலை ஆகும். இந்நூலில் 53 புலவர்கள் பாடிய 55 பாடல்கள் இடம்பெற்றுள்ளன.கி.பி 1812ஆம் ஆண்டில், தஞ்சை ஞானப்பிரகாசர் என்பவர், மரத்தால் ஆன அச்சுஎழுத்து உருக்களைப் பயன்படுத்தி, திருக்குறளையும், நாலடியாரையும் (மூலம் மட்டும்) அச்சுநூல்களாக வெளியிட்டார். இதுவே, தமிழில் வெளியான முதல் திருக்குறள் அச்சுநூலாகும்.
       </p>
       
      <Link to ='/kural' className='jklm'><p className='kuralgal'>குறள்கள்</p></Link> 
      </div>
      </div>
    </div>
  )
}

export default TamilTopics
